# -*- coding: utf-8 -*-
"""3.2.1. Числа.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1pbv4gzyEm-_a0gV0enxPZWF-gtaO2rtg

№ 3.2.1

Составьте программу, которая запрашивает у пользователя 2 целых числа и выполняет операции:

арифметические: +, -, * , / , // , %, **;

сравнение: <, <=, >, >=, !=, ==,

выводя на экран результат каждого действия. В случае получение вещественного результата, округлите его до 2-х знаков после запятой (используя функцию round()).
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_01.
#
# Выполнил: Белик М.К.
# Группа: АДЭУ-211



a = int(input("a="))
b = int(input("b="))

print(a + b)
print(a - b)
print(a * b)
print(round(a / b,2))
print(a // b)
print(a % b)
print(a ** b)
print(a < b)
print(a <= b)
print(a > b)
print(a >= b)
print(a != b)
print(a == b)

# --------------
# Пример вывода:
#
# a=2
# b=3
# 5
# -1
# 6
# 0.67
# 0
# 2
# 8
# True
# True
# False
# False
# True
# False

"""№ 3.2.2

Вычислите значение следующего выражения (аргументы - целые числа и вводятся с клавиатуры):

![Снимок.PNG](data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAPMAAACKCAYAAAB/23w2AAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAAEnQAABJ0Ad5mH3gAABDwSURBVHhe7Z3fhyNbu8ffPy03b9GEPoo+inmF0dHsmIuJfeyYI7wUw8Ro2YzMTeZi2mFi0zG8PTRhvHFampG+2NKMHLaMoRjCUAyhGb5nrVU/klRXd+dHJV21+nvxueiqTFLJ1KfWWs9a63n+9vPnTxBCsg9lJkQTKDMhmkCZCdEEykyIJlBmQjSBMhOiCZSZEE2gzIRoAmUmRBMoMyGaQJkJ0QTKTIgmUGZCNIEyE6IJlJkQTaDMhGgCZSZEEygzIZpAmQnRBMpMiCZQZkI0gTITogmUmRBNoMyEaAJlJkQTKDMhmkCZCdEEykyIJlBm3fnhYnIVc5xoB2XWmgEau3k0LuPOEd2gzDrzrY1S7r/w3zs55HLL8p/4R+zx5PmPv8cfv3+KaH+N+V1TCmXWmYs6jEdHGMWdI9pBmTXG+aOI3Ite7DmiH5RZY3ovcij+4cSeI/pBmbVlhKNHBuoXceeIjlBmXfneQSVXQvtbzLmEmUwWO0Y2C2XWlcsG8rsNDOLOJUof9VwOhlmG/Xsd9ZcVFE0D5mEfbuzryaagzJoyfl9C7rfOFoTyZPamcgzkH1fQPHPSsVDlawvFXB617jj+vGZQZk3pH+ZgvR3FnksWKXMRrTTOx36qz8wZ30z9U8y/zSCUWUsctPZzsD9OYs4lzQZl/rHe9TvHoncSI+8ce2IooslyV8qsIz+6sLfWWkqZ8yg8KaHyvA77IA/rn20Mv8e9dhnk+64Xje//biBXPYHz3YUbwflQRd4oZWqF111QZh356whWro5+3LnEGeLooIL2F//vqxGOHosWTwbf1mrxvLH46l1gF53fcqicutfPuT3Udg2UjvWag6fMGuKeVpB70sY45tw2kON12YWtdmJEWpj1ZR6d9zAcR4+PheQGDLurXbSdMmvI4HUexu/92HN34o7QeVWGZVkwTRNFW3aZx+i9Kqm/TbMA+3Taoo07VRiiO1w5nUaMA5nXa/nWlTke530Jxm4NPTf+fJahzNoxRvvJDd3Lu3CFQHsGysd+FPxLCwUhlGHIeeMexl86qFpiHJqroOOPieWDQ05JVUOZJ+jaUuYCjv7y33clNiDzuIOKkUPh3Tai/NuHMmuHlMBaSaTBaxP5F71p91OtIpNiltB2xPlXUuTIeFiMzwv7TQyDlu5rGyUhjJTfvdcx83UGr+SDp4yTa11vPaDMuqEWStjo/og5dyuie/26js7sQ+BTXXShhbzBNkrRBe+f9TGKRKrdiybKsgv+SHbNC6j8Tx/jtad7EpZ5fILy7HfREMqsGZOPNnL7LTgx55bF60LnkH89iD2/NoFgK1L+1+Iru8Yfyt6/03hLKGXWjNFbK6Eb1kH7F0+a7Sw+iZJky+xNU8nvsnJgMANQZq3wbtrS+xXXIjsD9C5G3lg3HC9Pg12S8fkR6qfbWiaakMxXPdTUd1k3wp5uKLNWyAR+K66a8iPXqiXuTry5avn3bJddLQgx1pw/XpQEZXZkLjTKTLKESuA335IujMwXJm5246CJgSNE2jNgGEKAR00MZUt95aDz3ITx60ki4/G7SVDmmQ0XlJlkA3nTrrqHWcpqF2DsmDB3LVSPhxh/OYFdEFKLv1WU+k0vgSj1oiQoc9jr2Fav4n6gzBqhEvjZXUxizmWPBGUWuH/10bvUt1WWUOasIVrQ7qEN++0R6gcmCnbH7/Z6K6/0SeAnZDaYw2wZKHPWUGNb0V38KLqL/ljQm2+VCfxyqJ3H/JussuZ+5ocGZc4aV2MM5Sos118IYVhoyvIzQQI/J/J68mCgzFnkh4N+p4XqXgF2x5/zlQn8jG3tYSZphDJnGJkWx9gp4ujzZIsJ/EhaocxZ49sQvbOhl3ggWAxR7eB/Dze4hppkAsqcMdTmh52CaI3F3yo9kAHrzb+3mMCPpBXKnDXcAZpPLZTtOqoHJkovu3Amcu3xanuYiT5QZh1QLXQNva2tziJphDKnmOFZb6GkfGpTxC/thdZMB2uUye3E/XZphzKnFZWvarHWdq0EfkQbKHNKkfm4cguNg70EfivvYSbaQJnTyEw6nbsj1HJDQh4NuQos9jx5KFDmFOJlkfRkvrP428oJ/IhuUOa0oVrlPPK7fjDmji2NKoGfxhknyeJQ5pQhW+X8qz56L3yZ7xB17QR+VxO4bsoWm/xw01HfOWNQ5lThoP2kopK0q0QDqqt9WxogL4HfWnuY1TbKNG3Q8LKC6pzeZ1NQ5rQS5q26Lbi1RgK/AMqsDZQ5rcxklLyxbpRK4FdC+1vMuUXZoszOWROVx3mvSkbOgPm0gd61a6fMq0KZU4uXA0vKfONuKCniqgn8ArYhs0wW+E8LhmGh1hl54+HvQzSfiO+318Rw7vWUeVUoc2rxbmrV1b5hn7IaV6+7h3njMrvoH8oFMPNlX8MidNd6FpR5VShzignqHMe3vl4Cvzvnoe9i0zJfNmDGfYevXTSeVWAfDyIPI8q8KpQ5xchMIvGtlyShBH4blrl/6LfAh4uuHafMq0KZ04xfZUJ2Ua9FrFUCvyJaXyPHl2WjMstou7x+Iee7HjovS7AsC9augbxVRuM8bj355mR2P7dhF0wYOzL41sQgqCnt43ysofy0hm5GkyJS5jSjotW+DNGNFFL0JBL4bVLmsPic90Aq/eEPCa5c9Pxx9HVpNySznB0wSmh9mfZ45gKLVzJPt7zO7GY4pcypJrjBrpciVQn8nrQX2u98K5uUeWZ6LaxZFZwLHlRGBZ3xzPENyeytrJPyTtB97nX9yx9mHpAyu6m8nnVnB+4RypxqvO2NSoaIuDI4lkgCvy3JfH2/9XTqbV7cZWT2p7xEC198O7hlDfsIndd1dOR20htK1aplsfI6Fx7bpw/KnHL6v/sBpLkutaMS+N24mGQZbpB5/K+y97lLYrzsTaW6tS7yVOb54NgSMs8MQ+Z/n5tRhQPE643nsxtYvM+UxxP5Te8JypxyVHda3bAzEe0fXdhJJfDbaADMe+jI69+IzD9dDI9tFB/dFEyL4q1ll585t088bK2zO16WUOa0E4zlZiPaSSbw26jMMmOKtzd7M93sJVEPQfmZkc0r5zV1HVnfSkqZ085MRDiIaKsEfvutZIqeb1jmsDby49a8KOqBJI4bNrpzU0QblDkcw89/3yAZRNbzqFHm1DOdqw1uNjmOTuzG27TMAlVGR05DvR3Clb2J8QBHTwxV9K7+KTpG3aDMV+K33JO/ZSEcoow+VL0VaoKsFxGgzKlnOs7zItoJJ/DbgswS56yBshXZMRU7Pt2gzJJvPTSeWsjv5GFaFooHBX8Yc9u+8WxAmTNAMO5U0qkIcYIJ/LYk8+JssmWeYDKZPxZEt3O/nqw/Z3/PUOYMoMbISuYS2ucygV+CrchDkdk5QXlH/oYFtQrMOz5C67E8ZogudnanpAIocxYIgkUC2044gd8DkXk6xTeV2f1oq26/IYYvjgY5xyhzFginVHzWSeAX5YHIrLKYiuFJ1d9T7V40UDSEyJb47pENF1mFMmcCb7tjIPNaCfyiPJRu9pWL/psyLNOEZZkwrTJqx30tWuQAypwJvEQEnsxrJvCLIsaSlWcnycxZJ8IE/ddlNC5Ya3pZNJHZW9ZX2M0jL5685Vc9jDV64kqCjQDxiQoI0UTm0duCarHst0coqS2DCbdeaSBYcpjhLXpks2RfZhkcUgJXcPSu6i1K2BNjQN1qL6maUuK73VGuhjxcsi/zJz+1jj9dM3E1LW3ibydMNPhFtCLzModjySSna1KJg5NnRRyxdCu5gYzLPF23zGLj5KGTSZknZzV/wX4crFVMHibZbpnDtDHZ3/FCyLpkW+ZVp2tUQfPZ1nwZDNTOuaCBpI9MyxzWME7xdM31hwHRkbj/+22TaZl7L7wfcu16S4RoQIZlnm4+WLveEiEakF2Zw22BK9Rb4piZaEh2ZQ5S0CZRb4kQDciszGEqnXWLjROiCZmVOSjbwuAXIR4ZlTkoqGag/inufArxN0qU3o303AiSSrysJTkjD8uUD/9sl5+5i0zJ7P7VR+/SCcVQ1RCysnRztrzpLWwkxewDZ3LZ9BMiUuZ0cNnwKw+I1viNF/zy6u3GvDaNqFxb8+Je41qtYpIIYTVKypwKglSpMptiU1bdz9iNr67/URP97y7cCOM/myjkzJhSLSQZgiJ1lDkduAM0n5rI7+ZhFmy0P2frxpdVKWKLo185aIlxnXnYZ1R+Y1BmkhgTOJc99L9eX2wyeC16GY+PMGJQbINQZrJhJhd1mOIGW3oF2ya5GqHzsgxzRwxpzDJqHW/qzxVjfnOvgUGkVlOIH+Azdi0vcvxLG6MvHdSeFlHcN2HIiPLTGk5kj8oVn/GqjMLjgvgcA3mZw/rDML5ncuVi+KGG8iMTpmkpis+aNxSdE9f5+QSNZ0X1vuYjcS0HFTTP2v5qwSVkdodo2971yd+h+WekJ/i1K76buO5uegKWlPm+8MuLGs/TtOPLQVuWWs1JEYSASgAptYW8Icb0C+Sydo79QmyGkMCy0fXTArvnNX/FnhBsz4T90c8M4/ZQUyVr86h/iry/EEqVft2z0QkklHK/lSViTVRP50Vy3pfVNZvVk2lPZzLCSVX0ftR3WVRm73eQ04jhLERkm23/0FvnkKbZB8p8T3jVB/No/Bl//l74vxZKBw30ZhI9qBZZBufOF4xRhFH76HcLurrXZyH6h/7xuZiCi67tCVP+EE0JFWyymdZZDqWLm64MpwUXlPnPBvJSXvFAmHS9elTzVSKDmtkJVuNMAMp8H8hWWd0M6Z4nd889kcNWdBFCmWvozcUBpjJHd7kFMucOZwrIf2mhoF4fv5Em+DdBzyYsexu3vHdJmUedBuqncngxzTFXOZ15mAWF/OS+gBTFOijzfSCf/PJm2G8tVxZm1d1eO0Ksm8a6N+CcVmEaRdG6LjlrEMoc3QAzlTm6ai9O5rkytjEChv9GdX+DFYHz7xGybMscEPzekdbeOfYrSqZsXwBlvgfCVuRJO5UFvkd/iDHpXhWdVQJzCck8LcF6h8xq15y/bDPyHiEryhw+UOYy2cxkhE3Zaj3KvHUctPZvufHuFT+4tC9au7kypxMM3tfRuliglU5I5mlN6vhudpBlJhAt2HiTRDfbY1qsb66LHa4ms6bj9ZRAmbfO9KZOm8yy+2jkS2hdunBnuuVOxxZj52mR8ltJSmbRde78dkMALIw5zETYg+W+cQGwz6uszZ629nPXGwyRUriPnjJvm7CVEKRIZhW1NixUXjVR2/ck8qak5LUai3cpz2RRc/lv7PkAmGjRgoLx9tnMcUHvuf97RKuSuOIBYIlrMUo4uvSFvnLQeS6nmgyU30empuTDSLyPediDG3y204G9579/3PTXLagFPeLfFYJttl9OUA3eK4VJJCnztgkL3Ymb7s0w/jXbRl3TzNrwqxFO7IIQw0D+cQXN8wWi2eFDyl+sobYcir/FAytoeeXDwQrnr0XLFrTiO6Y4bqmFKvLvuQeHkLd/XENp138/+f7B4pPZz/dxzpqoHIjPkO9pic+Trz1tekX3QhZsVa/G6L0qwxKfnZfXflBEIe+9x1zXOyVQ5vvAGaB3MZq2HiSVTH5EWvFwNqGMkxRu8qHMhFzDwcmvXk+gIFeB+cdH72QdcNHDEF3sNG6KocyERAnLHs3I7PrDIzF+b6dpLf0MlJmQKH4a53y1g7EcCn3voyGDgoY1jSukEMpMSAzuRRNly4RpeTu1yi/b6C+zeuweoMyEaAJlJkQTKDMhmkCZCdEEykyIJlBmQjSBMhOiBT/x/5Ukh1WGDVxTAAAAAElFTkSuQmCC)
Округлите результат до 3-х знаков после запятой, используя функцию round().
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_02.
#
# Выполнил: Белик М.К.
# Группа: АДЭУ-211



x = int(input("x="))
y = int(input("y="))
z = int(input("z="))

res = ((x**5+7)/(abs(-6)*y))**(1/3)/(7-(z % y))


print(round(res,2))

# --------------
# Пример вывода:
#
# x=0
# y=1
# z=2
# 0.15

"""№ 3.2.3

Дана электрическая цепь, состоящая из 2-х последовательно соединенных проводников (сопротивление каждого известно). Найти общее сопротивление цепи (округление результата необходимо выполнить до 1-го знака после запятой).

Решение (начало и общий ход мыслей):

Аналитическое решение.

Проводники соединены последовательно, поэтому общее сопротивление цепи будет равно сумме их сопротивлений. Сопротивление может быть вещественным числом, поэтому для его хранения необходимо выбрать тип float.

Алгоритм.

- ввести 2 вещественных значения - сопротивления проводников;
- вычислить их сумму;
- вывести ответ на экран.
Программа.

# здесь должна быть программа
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_03.
#
# Выполнил: Белик М.К.
# Группа: АДЭУ-211



# Сопротивление первого проводника
r1 = float(input("r1="))
# Сопротивление второго проводника
r2 = float(input("r2="))

# Общее сопротивление
r = r1 + r2

print(round(r,1))


# --------------
# Пример вывода:
#
# r1=12.2
# r2=16.1
# 28.3

"""№ 3.2.4

Дано двузначное и трехзначное число. Для каждого выведите на экран сумму и произведение цифр.
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_04.
#
# Выполнил: Белик М.К.
# Группа: АДЭУ-211



# Двузначное число
num2 = int(input("num2="))
# Трехзначное число
num3 = int(input("num3="))

# 1-я цифра числа 'num2'
num2_1 = num2 // 10
# 2-я цифра числа 'num2'
num2_2 = num2 % 10

# Сумма цифр числа 'num2'
num2_s = num2_1 + num2_2
# Произведение цифр числа 'num2'
num2_p = num2_1 * num2_2

# 1-я цифра числа 'num3'
num3_1 = num3 // 100
# 2-я цифра числа 'num3'
num3_2 = (num3 % 100) // 10
# 3-я цифра числа 'num3'
num3_3 = num3 % 10

# Сумма цифр числа 'num3'
num3_s = num3_1 + num3_2 + num3_3
# Произведение цифр числа 'num3'
num3_p = num3_1 * num3_2 * num3_3

print (num2_s,num2_p)
print (num3_s,num3_p)


# --------------
# Пример вывода:
#
# Двузначное число: 45
# Трехзначное число: 456
# Сумма и произведение цифр двузначного числа: 9 20
# Сумма и произведение цифр трехзначного числа: 15 120

"""№ 3.2.5

С начала суток прошло m минут (0<m≤24∗60). Определите:

целое количество часов, прошедших с начала суток;

количество минут, прошедших с момента начала последнего часа.
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_05.
#
# Выполнил: Белик М.К.
# Группа: АДЭУ-211



# Количество минут
m = int(input("m="))

# Количество часов, прошедших с начала суток
h = m // 60
# Количество минут, прошедших с момента начала последнего часа
m2 = m % 60


print("Количество часов, прошедших с начала суток:", h)
print("Количество минут, прошедших с момента начала последнего часа:", m2)

# --------------
# Пример вывода:
#
# Количество минут, прошедшее с начала суток: 123
# Количество часов, прошедших с начала суток: 2
# Количество минут, прошедших с момента начала последнего часа: 3

"""№ 3.2.6

Дано уравнение ax + b = 0 и отрезок [m;n]. Ответьте на вопрос, попадает ли решение уравнения в указанный отрезок.

Решение (начало и общий ход мыслей):

Аналитическое решение.

Коэффициенты уравнения и величина отрезка - произвольны, возьмем целые числа. Решение x при этом может быть дробным. После определения x составим логическое выражение попадания в отрезок, что и будет ответом.

Алгоритм.

- ввести все неизвестные величины;
- определить корень уравнения;
- составить логическое выражение попадания корня в область;
- вывести результат попадания на экран.
Программа.

# здесь должна быть программа
"""

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_06.
#
# Выполнил: Белик М.К.
# Группа: АДЭУ-211
# E-mail: !!!


a = int(input("a="))
b = int(input("b="))
m = int(input("m="))
n = int(input("n="))

x = -1 * (a / b)

is_ok = m <= x <= n

print("Попадает:", is_ok)


# --------------
# Пример вывода:
#
# Введите a = 1
# Введите b = 2
# Введите m = -5
# Введите n = 5
# Попадает: True